#Користувач робить внесок в розмірі n гривень строком на years років під 10% річних (щороку розмір його внеску збільшується на 10%. Ці гроші
#додаються до суми вкладу, і на них в наступному році теж будуть відсотки).
#Написати функцію bank, яка приймає аргументи n і years, і повертає суму, яка буде на рахунку користувача.
def bank(n,year):
    return n * 1.1**year

def main():
    n = float(input("Введіть суму внеска: "))
    year = int(input("Введіть кількість років:"))
    print("На вашому рахунку буде: %.3f"% bank(n,year) )

if __name__ == "__main__":
    main()